In [3]:
import pandas as pd
import numpy as np

In [4]:
dates = pd.date_range("20130101", periods=10,)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10'],
              dtype='datetime64[ns]', freq='D')

In [153]:
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))

In [152]:
df

                   0         1         2         3
2013-01-01  1.091524  2.388756 -0.950331  1.451393
2013-01-02  1.426488  0.934843 -1.261643  1.456909
2013-01-03 -0.451925  0.432101 -2.175398 -3.353157
2013-01-04  1.678670  0.555216 -0.152686 -0.386965
2013-01-05 -0.714943  0.483603 -1.159940 -0.271840
2013-01-06 -0.012576  0.128208 -0.197433 -0.353147
2013-01-07  0.098312 -0.292052 -1.514423 -0.799782
2013-01-08 -0.805733  0.200855 -0.183976 -0.571687
2013-01-09 -0.408645 -1.802175  0.555944 -0.014501
2013-01-10  0.038994  1.028867 -1.417068 -1.942818

## Otra forma de crear un **DataFrame**

In [11]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"), 
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## Tipos de datos

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Mosrando columnas

In [18]:
df2.D

0    3
1    3
2    3
3    3
Name: D, dtype: int32

In [23]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

## Indices y columnas

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.to_numpy()

array([[ 1.43766287,  0.09522919, -1.98046819, -0.07342221],
       [ 2.46540308,  1.9039334 ,  1.24440369,  1.94944241],
       [-1.72040269,  1.19173361, -1.65190978,  0.78882733],
       [ 0.55142097, -0.74255569,  0.20443482, -1.37314953],
       [-0.55039687,  0.00491397,  0.42041649,  0.42681094],
       [ 0.11706892,  1.27637912,  0.13674265, -0.33494007],
       [ 0.19158475,  1.28186701, -0.27289581, -0.07211977],
       [ 0.7775838 ,  1.14879527,  0.60773126,  0.83564382],
       [ 1.42511694, -0.9150567 ,  0.34123112,  0.87908329],
       [ 0.18416755, -0.44185189, -1.39841918,  1.39091448]])

In [27]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

## Summary of my **dataframes**

In [29]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.487921   0.480339  -0.234873   0.441709
std     1.157158   0.995715   1.075020   0.946791
min    -1.720403  -0.915057  -1.980468  -1.373150
25%     0.133844  -0.330160  -1.117038  -0.073097
50%     0.371503   0.622012   0.170589   0.607819
75%     1.263234   1.255218   0.400620   0.868223
max     2.465403   1.903933   1.244404   1.949442

In [30]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

## Transposing

In [31]:
df.T

,2013-01-01,2013-01-02,2013-01-03,2013-01-04,2013-01-05,2013-01-06,2013-01-07,2013-01-08,2013-01-09,2013-01-10
A,1.437663,2.465403,-1.720403,0.551421,-0.550397,0.117069,0.191585,0.777584,1.425117,0.184168
B,0.095229,1.903933,1.191734,-0.742556,0.004914,1.276379,1.281867,1.148795,-0.915057,-0.441852
C,-1.980468,1.244404,-1.651910,0.204435,0.420416,0.136743,-0.272896,0.607731,0.341231,-1.398419
D,-0.073422,1.949442,0.788827,-1.373150,0.426811,-0.334940,-0.072120,0.835644,0.879083,1.390914

In [32]:
df

                   A         B         C         D
2013-01-01  1.437663  0.095229 -1.980468 -0.073422
2013-01-02  2.465403  1.903933  1.244404  1.949442
2013-01-03 -1.720403  1.191734 -1.651910  0.788827
2013-01-04  0.551421 -0.742556  0.204435 -1.373150
2013-01-05 -0.550397  0.004914  0.420416  0.426811
2013-01-06  0.117069  1.276379  0.136743 -0.334940
2013-01-07  0.191585  1.281867 -0.272896 -0.072120
2013-01-08  0.777584  1.148795  0.607731  0.835644
2013-01-09  1.425117 -0.915057  0.341231  0.879083
2013-01-10  0.184168 -0.441852 -1.398419  1.390914

sorting by an axis:

In [35]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.073422 -1.980468  0.095229  1.437663
2013-01-02  1.949442  1.244404  1.903933  2.465403
2013-01-03  0.788827 -1.651910  1.191734 -1.720403
2013-01-04 -1.373150  0.204435 -0.742556  0.551421
2013-01-05  0.426811  0.420416  0.004914 -0.550397
2013-01-06 -0.334940  0.136743  1.276379  0.117069
2013-01-07 -0.072120 -0.272896  1.281867  0.191585
2013-01-08  0.835644  0.607731  1.148795  0.777584
2013-01-09  0.879083  0.341231 -0.915057  1.425117
2013-01-10  1.390914 -1.398419 -0.441852  0.184168

Selection

In [40]:
df.at

In [42]:
df.iat

In [43]:
df["A"]

2013-01-01    1.437663
2013-01-02    2.465403
2013-01-03   -1.720403
2013-01-04    0.551421
2013-01-05   -0.550397
2013-01-06    0.117069
2013-01-07    0.191585
2013-01-08    0.777584
2013-01-09    1.425117
2013-01-10    0.184168
Freq: D, Name: A, dtype: float64

In [44]:
df[:3]

                   A         B         C         D
2013-01-01  1.437663  0.095229 -1.980468 -0.073422
2013-01-02  2.465403  1.903933  1.244404  1.949442
2013-01-03 -1.720403  1.191734 -1.651910  0.788827

Selection by **Label**

In [46]:
df.loc[dates[0]]

A    1.437663
B    0.095229
C   -1.980468
D   -0.073422
Name: 2013-01-01 00:00:00, dtype: float64

In [47]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.437663  0.095229
2013-01-02  2.465403  1.903933
2013-01-03 -1.720403  1.191734
2013-01-04  0.551421 -0.742556
2013-01-05 -0.550397  0.004914
2013-01-06  0.117069  1.276379
2013-01-07  0.191585  1.281867
2013-01-08  0.777584  1.148795
2013-01-09  1.425117 -0.915057
2013-01-10  0.184168 -0.441852

In [48]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  2.465403  1.903933
2013-01-03 -1.720403  1.191734
2013-01-04  0.551421 -0.742556

In [49]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10'],
              dtype='datetime64[ns]', freq='D')

In [50]:
df.loc[dates[0], "A"]

1.437662867426294

In [51]:
df.iloc[range(1, 5), 1]

2013-01-02    1.903933
2013-01-03    1.191734
2013-01-04   -0.742556
2013-01-05    0.004914
Freq: D, Name: B, dtype: float64

In [56]:
df[df["A"] > 2]

                   A         B         C         D
2013-01-02  2.465403  1.903933  1.244404  1.949442

In [57]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.437663  0.095229       NaN       NaN
2013-01-02  2.465403  1.903933  1.244404  1.949442
2013-01-03       NaN  1.191734       NaN  0.788827
2013-01-04  0.551421       NaN  0.204435       NaN
2013-01-05       NaN  0.004914  0.420416  0.426811
2013-01-06  0.117069  1.276379  0.136743       NaN
2013-01-07  0.191585  1.281867       NaN       NaN
2013-01-08  0.777584  1.148795  0.607731  0.835644
2013-01-09  1.425117       NaN  0.341231  0.879083
2013-01-10  0.184168       NaN       NaN  1.390914

In [65]:
df2 = df.copy()

In [68]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three', 'four', 'six', 'eight', 'nine']

In [69]:
df2

                   A         B         C         D      E
2013-01-01  1.437663  0.095229 -1.980468 -0.073422    one
2013-01-02  2.465403  1.903933  1.244404  1.949442    one
2013-01-03 -1.720403  1.191734 -1.651910  0.788827    two
2013-01-04  0.551421 -0.742556  0.204435 -1.373150  three
2013-01-05 -0.550397  0.004914  0.420416  0.426811   four
2013-01-06  0.117069  1.276379  0.136743 -0.334940  three
2013-01-07  0.191585  1.281867 -0.272896 -0.072120   four
2013-01-08  0.777584  1.148795  0.607731  0.835644    six
2013-01-09  1.425117 -0.915057  0.341231  0.879083  eight
2013-01-10  0.184168 -0.441852 -1.398419  1.390914   nine

In [70]:
df2[ df2["E"].isin(["two", "six"]) ]

                   A         B         C         D    E
2013-01-03 -1.720403  1.191734 -1.651910  0.788827  two
2013-01-08  0.777584  1.148795  0.607731  0.835644  six

In [73]:
sl = pd.Series([1, 3, 4, 5, 6, 7, 8, 9, 10, 11], index=pd.date_range('20130102', periods=10))

In [74]:
sl

2013-01-02     1
2013-01-03     3
2013-01-04     4
2013-01-05     5
2013-01-06     6
2013-01-07     7
2013-01-08     8
2013-01-09     9
2013-01-10    10
2013-01-11    11
Freq: D, dtype: int64

In [75]:
df["F"] = sl

Setting values by label:

In [76]:
df.at[dates[0], "A"] = 0

Setting values by position:

In [77]:
df.iat[0, 1] = 0

In [82]:
df.loc[:, "D"] = np.array([5] * len(df))

In [83]:
df

                   A         B         C  D     F
2013-01-01  0.000000  0.000000 -1.980468  5   NaN
2013-01-02  2.465403  1.903933  1.244404  5   1.0
2013-01-03 -1.720403  1.191734 -1.651910  5   3.0
2013-01-04  0.551421 -0.742556  0.204435  5   4.0
2013-01-05 -0.550397  0.004914  0.420416  5   5.0
2013-01-06  0.117069  1.276379  0.136743  5   6.0
2013-01-07  0.191585  1.281867 -0.272896  5   7.0
2013-01-08  0.777584  1.148795  0.607731  5   8.0
2013-01-09  1.425117 -0.915057  0.341231  5   9.0
2013-01-10  0.184168 -0.441852 -1.398419  5  10.0

In [89]:
df2 = df.copy()
df2[df2 > 0 ] = -df2

In [90]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.980468 -2.5  NaN
2013-01-02 -1.232702 -0.951967 -0.622202 -2.5 -0.5
2013-01-03 -1.720403 -0.595867 -1.651910 -2.5 -1.5
2013-01-04 -0.275710 -0.742556 -0.102217 -2.5 -2.0
2013-01-05 -0.550397 -0.002457 -0.210208 -2.5 -2.5
2013-01-06 -0.058534 -0.638190 -0.068371 -2.5 -3.0
2013-01-07 -0.095792 -0.640934 -0.272896 -2.5 -3.5
2013-01-08 -0.388792 -0.574398 -0.303866 -2.5 -4.0
2013-01-09 -0.712558 -0.915057 -0.170616 -2.5 -4.5
2013-01-10 -0.092084 -0.441852 -1.398419 -2.5 -5.0

## Missing data

In [91]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [94]:
df1.loc[dates[0]:dates[1], 'E']= 1

In [95]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.980468  5  NaN  1.0
2013-01-02  2.465403  1.903933  1.244404  5  1.0  1.0
2013-01-03 -1.720403  1.191734 -1.651910  5  3.0  NaN
2013-01-04  0.551421 -0.742556  0.204435  5  4.0  NaN

To drop any rows that have missing data:

In [96]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  2.465403  1.903933  1.244404  5  1.0  1.0

Felling missing data:

In [97]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.980468  5  5.0  1.0
2013-01-02  2.465403  1.903933  1.244404  5  1.0  1.0
2013-01-03 -1.720403  1.191734 -1.651910  5  3.0  5.0
2013-01-04  0.551421 -0.742556  0.204435  5  4.0  5.0

To get the boolean mask where are are **nan**

In [100]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

In [105]:
df1.mean(axis=1, )

2013-01-01    0.803906
2013-01-02    2.102290
2013-01-03    1.163884
2013-01-04    1.802660
Freq: D, dtype: float64

In [116]:
s = pd.Series([1, 2, 3, np.nan, 5, np.nan], index=pd.date_range(start="1/08/2022", periods=6)).shift(2)

In [115]:
s

2022-01-08    1.0
2022-01-09    2.0
2022-01-10    3.0
2022-01-11    NaN
2022-01-12    5.0
2022-01-13    NaN
Freq: D, dtype: float64

In [119]:
df.sub(s, axis="index")

             A   B   C   D   F
2013-01-01 NaN NaN NaN NaN NaN
2013-01-02 NaN NaN NaN NaN NaN
2013-01-03 NaN NaN NaN NaN NaN
2013-01-04 NaN NaN NaN NaN NaN
2013-01-05 NaN NaN NaN NaN NaN
2013-01-06 NaN NaN NaN NaN NaN
2013-01-07 NaN NaN NaN NaN NaN
2013-01-08 NaN NaN NaN NaN NaN
2013-01-09 NaN NaN NaN NaN NaN
2013-01-10 NaN NaN NaN NaN NaN
2022-01-08 NaN NaN NaN NaN NaN
2022-01-09 NaN NaN NaN NaN NaN
2022-01-10 NaN NaN NaN NaN NaN
2022-01-11 NaN NaN NaN NaN NaN
2022-01-12 NaN NaN NaN NaN NaN
2022-01-13 NaN NaN NaN NaN NaN

## Apply

In [122]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.980468   5   NaN
2013-01-02  2.465403  1.903933 -0.736065  10   1.0
2013-01-03  0.745000  3.095667 -2.387974  15   4.0
2013-01-04  1.296421  2.353111 -2.183539  20   8.0
2013-01-05  0.746024  2.358025 -1.763123  25  13.0
2013-01-06  0.863093  3.634404 -1.626380  30  19.0
2013-01-07  1.054678  4.916271 -1.899276  35  26.0
2013-01-08  1.832262  6.065067 -1.291545  40  34.0
2013-01-09  3.257379  5.150010 -0.950314  45  43.0
2013-01-10  3.441546  4.708158 -2.348733  50  53.0

In [123]:
df.apply( lambda x: x.max() - x.min() )

A    4.185806
B    2.818990
C    3.224872
D    0.000000
F    9.000000
dtype: float64

## histogramming

In [134]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [136]:
s

0    0
1    2
2    3
3    6
4    6
5    0
6    4
7    3
8    3
9    2
dtype: int64

In [137]:
s.value_counts()

3    3
0    2
2    2
6    2
4    1
dtype: int64

In [138]:
s = pd.Series(['A', 'B', 'C', np.nan, 'Vaca', 'ELENA', 'MARCO'], )

In [139]:
s.str.lower()

0        a
1        b
2        c
3      NaN
4     vaca
5    elena
6    marco
dtype: object

## Merge

In [145]:
np.arange( 1,5, dtype='int8')

array([1, 2, 3, 4], dtype=int8)

## concat

In [154]:
df = pd.DataFrame(np.random.randn(10, 4) )

In [155]:
df

          0         1         2         3
0  0.714186 -0.290370  1.065627 -1.079738
1 -0.378876  1.847910  3.219014  0.387834
2 -1.128152  0.345687 -0.149496  0.367439
3  1.833947  0.560265 -0.138650  0.120767
4  1.128870 -0.034095 -0.019235 -0.157543
5 -0.923255 -0.645331 -0.858551 -0.023121
6  0.057989 -0.107046 -0.347622 -0.222945
7 -1.556111 -0.609836 -0.529269 -2.357401
8  1.376995 -0.559430  0.319287 -0.514311
9 -1.341096  1.105666  1.367204  1.069645

In [157]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.714186 -0.290370  1.065627 -1.079738
 1 -0.378876  1.847910  3.219014  0.387834
 2 -1.128152  0.345687 -0.149496  0.367439,
           0         1         2         3
 3  1.833947  0.560265 -0.138650  0.120767
 4  1.128870 -0.034095 -0.019235 -0.157543
 5 -0.923255 -0.645331 -0.858551 -0.023121
 6  0.057989 -0.107046 -0.347622 -0.222945,
           0         1         2         3
 7 -1.556111 -0.609836 -0.529269 -2.357401
 8  1.376995 -0.559430  0.319287 -0.514311
 9 -1.341096  1.105666  1.367204  1.069645]